[
  {
    "missionId": 1,
    "missionTitle": "NASA’s Artemis I Spacecraft Prepped to Depart to Ohio Facility",
    "summary": "NASA's Artemis I Orion spacecraft, having completed its 1.4 million-mile celestial odyssey, is undergoing preparatory measures in Florida for subsequent advanced testing at a dedicated Ohio facility.",
    "imageUrl": "https://www.nasa.gov/wp-content/uploads/2024/01/ksc-20231222-ph-kls01-0058.jpg?resize=1536,1024",
    "link": "https://www.nasa.gov/image-article/nasas-artemis-i-spacecraft-prepped-to-depart-to-ohio-facility/"
  },
  {
    "missionId": 2,
    "missionTitle": "One Year Ago: Artemis I Lifts Off",
    "summary": "The Artemis I mission, a pivotal milestone in lunar exploration, launched on Nov. 16, 2022, culminating with an oceanic splashdown on Dec. 11, after an extensive lunar orbit and a 270,000-mile traverse from Earth.",
    "imageUrl": "https://www.nasa.gov/wp-content/uploads/2023/11/52508519778-6fda3b2c74-o.jpg?resize=1331,2000",
    "link": "https://www.nasa.gov/image-article/one-year-ago-artemis-i-lifts-off/"
  },
  {
    "missionId": 3,
    "missionTitle": "Artemis III Launch",
    "summary": "Building upon the success of two preceding Artemis test missions, Artemis III is set to mark a historic resurgence in lunar exploration, over half a century since humanity last graced the Moon's surface, focusing on the uncharted South Pole region.",
    "imageUrl": "https://www.nasa.gov/wp-content/uploads/2023/01/52508358665_efb8a65d31_o_0.jpg?resize=900,334",
    "link": "https://www.nasa.gov/missions/artemis/artemis-iii/"
  },
  {
    "missionId": 4,
    "missionTitle": "First Artemis Crew Trains for Mission Around Moon",
    "summary": "A cadre of four astronauts are engaged in intensive training for Artemis II, NASA's inaugural crewed mission using the SLS rocket and Orion spacecraft, aimed at validating critical life-support systems for future lunar expeditions.",
    "imageUrl": "https://www.nasa.gov/wp-content/uploads/2023/10/jsc2023e055720-alt.jpg?resize=1536,1024",
    "link": "https://www.nasa.gov/general/first-artemis-crew-trains-for-mission-around-moon/"
  },
  {
    "missionId": 5,
    "missionTitle": "Artemis II Map",
    "summary": "Destined to be NASA's first crewed deep space foray, Artemis II mission will conduct a comprehensive evaluation of the Orion spacecraft and SLS rocket over a 10-day journey, paving the trajectory for future manned lunar landings.",
    "imageUrl": "https://www.nasa.gov/wp-content/uploads/2023/02/artemis-2-map-october-2021.jpeg",
    "link": "https://www.nasa.gov/missions/artemis/artemis-ii-map/"
  },
  {
    "missionId": 6,
    "missionTitle": "A Walk Through the Rainbow with PACE",
    "summary": "The PACE mission, an endeavor by NASA, leverages the spectrum of visible electromagnetic wavelengths to glean groundbreaking insights into Earth's atmospheric dynamics and marine ecosystems.",
    "imageUrl": "https://www.nasa.gov/wp-content/uploads/2020/07/englishchannel_oli_2020175_lrg.jpg?resize=1536,1352",
    "link": "https://www.nasa.gov/science-research/earth-science/a-walk-through-the-rainbow-with-pace/"
  },
  {
    "missionId": 7,
    "missionTitle": "PACE",
    "summary": "The Plankton, Aerosol, Cloud, Ocean Ecosystem (PACE) initiative is a strategic mission to augment our understanding of ocean health, focusing on the intricate distribution patterns of phytoplankton, vital to the equilibrium of the marine food web.",
    "imageUrl": "https://www.nasa.gov/wp-content/uploads/2019/08/svs_pace_beauty2.jpg?resize=600,338",
    "link": "https://www.nasa.gov/event/pace/"
  },
  {
    "missionId": 8,
    "missionTitle": "NASA’s PACE Mission Will Uncover New Information About Health of Our Oceans",
    "summary": "The PACE mission is at the vanguard of assessing the impact of climate change on marine and atmospheric conditions, utilizing a state-of-the-art ocean color instrument to analyze the interplay of oceans, clouds, and airborne particulates.",
    "imageUrl": "https://www.nasa.gov/wp-content/uploads/2016/07/5319841177_e97350cd26_o.jpg?resize=1715,2000",
    "link": "https://www.nasa.gov/technology/nasas-pace-mission-will-uncover-new-information-about-health-of-our-oceans/"
  },
  {
    "missionId": 9,
    "missionTitle": "Two Rovers to Roll on Mars Again: Curiosity and Mars 2020",
    "summary": "In the upcoming summer, NASA's Mars 2020 rover, a distinct entity from Curiosity, is slated to augment the Martian exploration, with a focused mission on unraveling the secrets of ancient Martian life.",
    "imageUrl": "https://www.nasa.gov/wp-content/uploads/2019/12/pia23517-16.jpg?resize=1536,864",
    "link": "https://www.nasa.gov/solar-system/two-rovers-to-roll-on-mars-again-curiosity-and-mars-2020/"
  },
  {
    "missionId": 10,
    "missionTitle": "The Space Shuttle",
    "summary": "The Space Shuttle, an icon of aerospace ingenuity, represents the world's first reusable spacecraft. This technological marvel, comprising the orbiter, main engines, external tank, and solid rocket boosters, seamlessly blended rocket launch dynamics with spacecraft orbital maneuverability and airplane-like landing capabilities.",
    "imageUrl": "https://images-assets.nasa.gov/image/201011030002HQ/201011030002HQ~large.jpg?w=1536&h=1022&fit=crop&crop=faces%2Cfocalpoint",
    "link": "https://www.nasa.gov/reference/the-space-shuttle/"
  },
  {
    "missionId": 11,
    "missionTitle": "NASA’s Webb Delivers Deepest Infrared Image of Universe Yet",
    "summary": "The James Webb Space Telescope, in a monumental scientific achievement, has transmitted the most profound and sharp infrared image of the distant cosmos to date. This image, focusing on the galaxy cluster SMACS 0723, reveals an astonishing array of galaxies, including some of the faintest objects ever observed in the infrared spectrum.",
    "imageUrl": "https://www.nasa.gov/wp-content/uploads/2023/03/main_image_deep_field_smacs0723-5mb.jpg?resize=768,783",
    "link": "https://www.nasa.gov/image-article/nasas-webb-delivers-deepest-infrared-image-of-universe-yet/"
  },
  {
    "missionId": 12,
    "missionTitle": "Hubble Spacecraft 360º Tour",
    "summary": "Embark on a virtual odyssey to the Hubble Spacecraft in orbit, exploring its intricate workings and groundbreaking capabilities through an immersive 360-degree virtual tour.",
    "imageUrl": "https://smd-cms.nasa.gov/wp-content/uploads/2023/04/hubble_faq_image-jpg.webp?w=640&format=webp",
    "link": "https://science.nasa.gov/mission/hubble/multimedia/online-activities/hubble-360-degree-virtual-tour/"
  },
  {
    "missionId": 13,
    "missionTitle": "NASA’s Webb Sheds Light on Galaxy Evolution, Black Holes",
    "summary": "The James Webb Space Telescope's latest imagery offers an unprecedented glimpse into the intricate dynamics of galaxy interaction, triggering stellar formation and perturbing galactic gaseous states, thereby shedding new light on the evolution of galaxies and the enigmatic nature of black holes.",
    "imageUrl": "https://www.nasa.gov/wp-content/uploads/2023/03/main_image_galaxies_stephans_quintet_sq_nircam_miri_final-5mb.jpg?resize=768,736",
    "link": "https://www.nasa.gov/image-article/nasas-webb-sheds-light-galaxy-evolution-black-holes/"
  },
  {
    "missionId": 14,
    "missionTitle": "About Human Landing Systems Development",
    "summary": "The Human Landing System (HLS) represents the pinnacle of transport technology designed to convey astronauts to the lunar surface within the Artemis program's framework, earmarking a historical moment with the first woman and the first person of color to set foot on the Moon.",
    "imageUrl": "https://www.nasa.gov/wp-content/uploads/2022/11/spacex_starship_hls_artemis_iii_2_crew_0.jpg?resize=768,432",
    "link": "https://www.nasa.gov/reference/human-landing-systems/"
  },
  {
    "missionId": 15,
    "missionTitle": "NASA Selects Companies to Develop Commercial Destinations in Space",
    "summary": "In a groundbreaking move, NASA has forged agreements with three American corporations, commissioning them to conceptualize and develop designs for space stations and other commercial outposts in space, potentially revolutionizing the future of space habitation and commerce.",
    "imageUrl": "https://www.nasa.gov/wp-content/uploads/2021/12/cdff_awardee_1.jpg?resize=695,900",
    "link": "https://www.nasa.gov/news-release/nasa-selects-companies-to-develop-commercial-destinations-in-space/"
  }
]
